<a href="https://colab.research.google.com/github/theysee/sberbank_reboot/blob/master/%D0%A8%D0%BA%D0%BE%D0%BB%D0%B0_DA_%D0%9F%D0%BE%D1%82%D0%BE%D0%BA_3_%D0%90%D0%BD%D0%B0%D0%BB%D0%B8%D0%B7_%D0%BF%D1%80%D0%BE%D0%B4%D0%B0%D0%B6_%D0%BA%D1%80%D1%83%D0%BF%D0%BD%D0%BE%D0%B9_%D1%81%D1%82%D1%80%D0%BE%D0%B8%D1%82%D0%B5%D0%BB%D1%8C%D0%BD%D0%BE%D0%B9_%D0%BA%D0%BE%D0%BC%D0%BF%D0%B0%D0%BD%D0%B8%D0%B8_%D0%A1%D0%B5%D1%80%D0%B3%D0%B5%D0%B9_%D0%90%D1%80%D1%82%D0%B5%D0%B5%D0%B2_.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
!pip install PyMySQL

Requirement already satisfied: PyMySQL in /usr/local/lib/python3.6/dist-packages (0.9.3)

In [0]:
import numpy as np
import pandas as pd
import pymysql
from datetime import datetime, timedelta, date
import matplotlib as mpl
import matplotlib.pyplot as plt
import seaborn as sns
from matplotlib import cm
from matplotlib.colors import ListedColormap, LinearSegmentedColormap
from matplotlib.ticker import (MultipleLocator, FormatStrFormatter,
                               AutoMinorLocator)
%matplotlib inline

In [0]:
DB_HOST = '89.223.95.235'
DB_USER = 'student_12'
DB_USER_PASSWORD = 'student_12'
DB_NAME = 'student_12'
conn = pymysql.connect(DB_HOST, DB_USER, DB_USER_PASSWORD, DB_NAME)

In [13]:
pd.read_sql_query("show tables", conn)

Empty DataFrame
Columns: [Tables_in_student_12]
Index: []

In [0]:
#query = "DELETE FROM Annonce"
#conn.cursor().execute(query)
#conn.commit()

In [0]:
#query = "DROP TABLE IF EXISTS Annonce"
#conn.cursor().execute(query)
#conn.commit()

In [0]:
!wget https://web.stanford.edu/class/archive/cs/cs109/cs109.1166/stuff/titanic.csv

In [20]:
data = pd.read_csv('titanic.csv', sep=',', header='infer')
data.head(15)

    Survived  Pclass  ... Parents/Children Aboard     Fare
0          0       3  ...                       0   7.2500
1          1       1  ...                       0  71.2833
2          1       3  ...                       0   7.9250
3          1       1  ...                       0  53.1000
4          0       3  ...                       0   8.0500
5          0       3  ...                       0   8.4583
6          0       1  ...                       0  51.8625
7          0       3  ...                       1  21.0750
8          1       3  ...                       2  11.1333
9          1       2  ...                       0  30.0708
10         1       3  ...                       1  16.7000
11         1       1  ...                       0  26.5500
12         0       3  ...                       0   8.0500
13         0       3  ...                       5  31.2750
14         0       3  ...                       0   7.8542

[15 rows x 8 columns]

In [0]:
#queries = "INSERT INTO people (name, passport) VALUES ('Spy', 12345)"
queries = []

#for i, j in data.items():
  #for k in j:
    #querie = f'''INSERT INTO Events (annonce_id, date_events, result_events, income_events) VALUES ('{i}', '{k[0]}', '{k[1]}', '{k[2]}')'''
    #queries.append(querie)

#for q in queries:
  #conn.cursor().execute(q)
#conn.commit()